app/controllers/projects_controller.rb

INSERT INTO "projects" ("created_at", "location", "title", "type", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Tue, 12 Aug 2014 07:01:56 UTC +00:00], ["location", ""], ["title", "大唐"], ["type", ""], ["updated_at", Tue, 12 Aug 2014 07:01:56 UTC +00:00]]
---
  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save

UPDATE "projects" SET "location" = ?, "longitude" = ?, "latitude" = ?, "updated_at" = ? WHERE "projects"."id" = 1  [["location", "呼和浩特"], ["longitude", 111.3603], ["latitude", 40.2032], ["updated_at", Tue, 12 Aug 2014 07:09:36 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @project.update(project_params)